### Terraform `plan` Succeeded for Workspace: `dev`
<details open><summary>Show Output</summary>

```diff
Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.vpc.aws_eip.nat[0] has changed
!   resource "aws_eip" "nat" {
+       association_id       = "eipassoc-0a55122a13fb6435b"
        id                   = "eipalloc-089978cfaec6f327e"
+       network_interface    = "eni-0fffdcfcedf893d8c"
+       private_dns          = "ip-10-0-0-119.ec2.internal"
+       private_ip           = "10.0.0.119"
        tags                 = {
            "Name"        = "jingood2-dev-vpc-us-east-1a"
            "environment" = "dev"
            "owners"      = "jingood2"
        }
        # (8 unchanged attributes hidden)
    }

  # module.vpc.aws_route_table.private[0] has changed
!   resource "aws_route_table" "private" {
        id               = "rtb-06cab19d9fd7b4f46"
!       route            = [
+           {
+               carrier_gateway_id         = ""
+               cidr_block                 = "0.0.0.0/0"
+               core_network_arn           = ""
+               destination_prefix_list_id = ""
+               egress_only_gateway_id     = ""
+               gateway_id                 = ""
+               instance_id                = ""
+               ipv6_cidr_block            = ""
+               local_gateway_id           = ""
+               nat_gateway_id             = "nat-073612ace0a531e49"
+               network_interface_id       = ""
+               transit_gateway_id         = ""
+               vpc_endpoint_id            = ""
+               vpc_peering_connection_id  = ""
            },
        ]
        tags             = {
            "Name"        = "jingood2-dev-vpc-private"
            "environment" = "dev"
            "owners"      = "jingood2"
        }
        # (5 unchanged attributes hidden)
    }

  # module.vpc.aws_route_table.public[0] has changed
!   resource "aws_route_table" "public" {
+       arn              = "arn:aws:ec2:us-east-1:484752921218:route-table/rtb-0a1d0e4acc67c8e4e"
        id               = "rtb-0a1d0e4acc67c8e4e"
+       owner_id         = "484752921218"
        tags             = {
            "Name"        = "jingood2-dev-vpc-public"
            "environment" = "dev"
            "owners"      = "jingood2"
        }
        # (4 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.vpc.aws_route.public_internet_gateway[0] will be created
+   resource "aws_route" "public_internet_gateway" {
+       destination_cidr_block = "0.0.0.0/0"
+       gateway_id             = "igw-0381d3a09cc02831f"
+       id                     = (known after apply)
+       instance_id            = (known after apply)
+       instance_owner_id      = (known after apply)
+       network_interface_id   = (known after apply)
+       origin                 = (known after apply)
+       route_table_id         = (known after apply)
+       state                  = (known after apply)

+       timeouts {
+           create = "5m"
        }
    }

  # module.vpc.aws_route_table.public[0] is tainted, so must be replaced
-/+ resource "aws_route_table" "public" {
!       arn              = "arn:aws:ec2:us-east-1:484752921218:route-table/rtb-0a1d0e4acc67c8e4e" -> (known after apply)
!       id               = "rtb-0a1d0e4acc67c8e4e" -> (known after apply)
!       owner_id         = "484752921218" -> (known after apply)
!       propagating_vgws = [] -> (known after apply)
!       route            = [] -> (known after apply)
        tags             = {
            "Name"        = "jingood2-dev-vpc-public"
            "environment" = "dev"
            "owners"      = "jingood2"
        }
        # (2 unchanged attributes hidden)
    }

  # module.vpc.aws_route_table_association.public[0] will be created
+   resource "aws_route_table_association" "public" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = "subnet-0c431b1a8e0fc39f4"
    }

  # module.vpc.aws_route_table_association.public[1] will be created
+   resource "aws_route_table_association" "public" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = "subnet-028fec94f8df6d52e"
    }

Plan: 4 to add, 0 to change, 1 to destroy.
```
</details>